In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('hr_raw_data.csv')
df.head()

,Employee ID,Full Name,Job Title,Department,Business Unit,Gender,Ethnicity,Age,Hire Date,Annual Salary,Bonus %,Country,City,Exit Date,Latitude,Longitude
0,E00005,Riley Washington,Director,Sales,Speciality Products,Female,Caucasian,39,4/29/2007,"$171,487",0.23,United States,Phoenix,NaN,33.604978,-112.454690
1,E00013,Raelynn Ma,Senior Analyst,Finance,Speciality Products,Female,Asian,33,10/8/2015,"$94,876",0.00,United States,Miami,NaN,25.782384,-80.311859
2,E00013,Elena Vang,Analyst,Finance,Corporate,Female,Asian,52,2/19/2019,"$55,859",0.00,China,Beijing,NaN,39.938417,116.067824
3,E00022,Elena Her,Account Representative,Sales,Manufacturing,Female,Asian,62,9/17/2006,"$64,669",0.00,China,Chongqing,NaN,29.554811,106.383746
4,E00023,Gabriel Joseph,Director,Engineering,Manufacturing,Male,Caucasian,52,10/28/2006,"$187,992",0.28,United States,Miami,NaN,25.782384,-80.311859

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 16 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Employee ID    1000 non-null   object
 1   Full Name      1000 non-null   object
 2   Job Title      1000 non-null   object
 3   Department     1000 non-null   object
 4   Business Unit  1000 non-null   object
 5   Gender         1000 non-null   object
 6   Ethnicity      1000 non-null   object
 7   Age            1000 non-null   int64
 8   Hire Date      1000 non-null   object
 9   Annual Salary  1000 non-null   object
 10  Bonus %        1000 non-null   float64
 11  Country        1000 non-null   object
 12  City           1000 non-null   object
 13  Exit Date      85 non-null     object
 14  Latitude       1000 non-null   float64
 15  Longitude      1000 non-null   float64
dtypes: float64(3), int64(1), object(12)
memory usage: 125.1+ KB

In [5]:
df.columns = [col.strip().lower().replace(" ", "_") for col in df.columns]

In [6]:
df.to_csv('hr_raw_data.csv', index=False)